{"Chapter-on-The-History-of-Proteins":{"title":"Chapter on The History of Proteins","links":[],"tags":[],"content":""},"Formalisms/A-Survey-of-Prompt-Mutations":{"title":"A Survey of Prompt Mutations","links":["Formalisms/Genetic-Notation-for-Prompts","List-order-fixing","Cognitohazard"],"tags":["biology","LLM"],"content":"Mutation Classes\nPrompts can have varying “mutational loads” with missense, nonsense, and synonymous mutations.\nAs partially defined by the Genetic Notation for Prompts\nSynonymous\nOccasionally the typo produces another valid, yet unintentional prompt. This can either be synonymous, as in there is no change to the meaning of the prompt.\nSynonymous: This is not an issue → This is non-issue\nThis is where\nr \\not= r_{m}, \\mathbf{x} \\not=\\mathbf{x}_{m}, \\mathbb{I}_{r}=\\mathbb{I}_{r,m}\nMissense\nWhen a mutation still is a valid word it can alter the meaning of a prompt.\nMissense: This is not an issue → This is an issue\nr \\not= r_{m}, \\mathbf{x} \\not=\\mathbf{x}_{m}, \\mathbb{I}_{r} \\not =\\mathbb{I}_{r,m}\nSpecifically, there exists a subset that satisfies either of these two conditions:\n\\exists \\hspace{0.1 cm} \\mathbb{I}_{gain} \\subseteq \\mathbb{I}_{r,m} -(\\mathbb{I}_{r,m}\\cap\\mathbb{I}_{r})\n\\exists \\hspace{0.1 cm} \\mathbb{I}_{loss} \\subseteq \\mathbb{I}_{r} -(\\mathbb{I}_{r,m}\\cap\\mathbb{I}_{r})\nWhich describes the change in information in the transformation r \\to r_{m}\nNonsense\nThis essentially means that while typing up a prompt I can misspell and that misspelling can frequently be ignored as the language model can infer what I mean.\nExample: This is not an issue → This is not an ixsue\nr \\not= r_{m}, \\mathbf{x} \\not=\\mathbf{x}_{m}, \\mathbb{I}_{r} \\not =\\mathbb{I}_{r,m}\nHowever these mutations may be easily corrected by the casual observer through a simple spell check or relational decoding.\nCorr(\\mathbf{x}_{m})=\\mathbf{x}_{corr}\nIf the correction is successful then:\n\\mathbf{x}_{corr}=\\mathbf{x}\nElse:\n\\mathbf{x}_{corr} \\not=\\mathbf{x}\nIn this simple case that means the ambiguous mutation is similar to Missense.\nAmbiguous\nHowever a nonsense decoding may result in an ambiguous mutation that may be “corrected” into multiple valid meanings or an incorrect meaning. We may assign multiple possible corrections with associated probabilities.\nExample: Set → Oet, Corr(Xet) → {Set, Pet, Met, Let, Get, Out, Oat}\nIn this case we can define:\n\\mathbb{x}_{corr}=\\{ \\mathbf{x}_{i},p_{i} \\}\nwhere p_i defines the probability that the corrected token sequence is \\mathbf{x}_{i}\nThis gives us some probability that a nonsense mutation will be read as either a missense or a  synonymous mutation where:\nPr(missense|\\mathbb{x}_{corr})=\\frac{\\sum_{i\\not=j}{p_{i}}}{n}\nWhere j is the probability of reverting to the original, unmutated, word.\nMutation Methods\nPoint Mutations\nAll point mutations can belong to any of the above classes.\nSubstitution\nThis is where a letter is swapped for another.\ncat → bat\nFrameshift\nThis is luckily dealt with by the addition of the positional encoding, so it is not as devastating as it is in biology.\nInsertion\nThis is where a letter is inserted into the prompt that was not there prior.\ncat → cath\nDeletion\nThis is where a letter is deleted from the original prompt.\ncat → ca\nLarge Scale Mutations\nInversion\nThis is where a section of text is inverted\ncat → tac\nDuplication\nA section of text is repeated\ncat → catcat\nGene Duplication\nTaking the definition of a gene ^b70465 we can consider the effect when a duplication effect occurs. This means that some information is repeated.\nExamples:\nthe cat is red there→ the cat is red there the cat is red there\nThe cat is red there → the cat is red there is a red cat\nWhich implies that there is some subset of \\mathbb{I}_{r} that contains redundant information {}^r\\mathbb{I}_{i}\n{}^r\\mathbb{I}_{i} \\in \\mathbb{I}_{r}\nof the form:\n{}^r\\mathbb{I}_{cat,red}=\\{I_{cat,red}=\\phi^`(\\mathbf{x}_{i-j}),I_{cat,red}=\\phi^`(\\mathbf{x}_{k-l}) \\}\nMovement of a gene\nSo this is related to the problems of List order fixing wherein the location of information in a prompt is important for the outcome. This form of mutation is when an entire gene is moved into a new location.\nExample:\nMy cat is hungry. My cat is red. → My cat is red. My cat is hungry.\nFusion\nThis is when a gene is mixed with another gene to form a new one. These may be functional or non-functional depending on the method. Sometimes it even grants a completely new function.\nExample:\nMy cat is hungry. My cat is red. → My red cat is hungry.\nNovel fusion\nWhen a fusion produces a novel piece of information instead of just mashing the information together.\nExample:\nMy cat is hungry. My parrot is red. → My red parrot is hungry.\nMutation Functions\nA mutation might have many functional outcomes after occurring.\nLoss of function\nThis is where the change in the prompt prevents the accessing of an informational state we are interested in.\nI_{target} \\in \\mathbb{I}_{loss}\nGain of function\nThis is the inverse, wherein a new piece of information is gained by the mutation.\nI_{target} \\in \\mathbb{I}_{gain}\nSwitch of function\nThis is where the gain of information removes the original information present. Meaning that:\n\\mathbb{I}_{r,m}\\cap\\mathbb{I}_{r} = \\emptyset\nConservation of function\nBasically just a synonymous mutation.\n\nDominant Negative\nThis is similar to a Cognitohazard, where if this mutation occurs it counteracts the ability of other information from being interpreted.\nExample:\nI have a pet dog that I feed every weekend. I am gone this weekend and need help.→ I had a pet dog that I fed every weekend. I am gone this weekend and need help.\nIn this case the dog needs to be fed this weekend, but due to the tense change we are unable to discern this information.\nI have a pet dog. → (Insert 50 repeating A’s here) I have a pet dog\nIn this case the addition of the 50 A prompt injection will render the “I have a pet dog” an extraneous piece of information in the face of the garbled nonsense outputted.\nIn both cases the language model processes the mutated information wrong, therefore related information is unable to be accessed despite it ostensibly still existing in the text.\nLethal Negative\nThis is where the loss of information is so intense that the language model is no longer able to parse anything. And no output produced will result in a success. We can consider this a case where our verification layer completely fails.\nExample:\nI am hungry for food → rood if hun am for gy\nNull Mutation\nA loss of function mutation that completely removes the ability of the language model to parse the input. Perhaps this would be a token that does not exist in the language models repertoire resulting in an error.\nSuppressor Mutation\nThis is a double mutation where a compensation event occurs. This means the mutation “fixes” the problem introduced by the previous one. However caution with this mutation as it can lead to unexpected cascades down the line as nuance may be subtly shifted.\nExample:\nI am hungry for a red bass. → I hunger for a red ass → I hunger for a red fish\nI am hungry for a red bass → I am hungry for a red ass → I am hungry for a red bass\nConditional Mutation\nThis is a mutation that can be fine under permissive environments, but become dangerous under stressful ones. For example if we are using an advanced language model then the presence of some mutations isn’t as big a deal. However if we switch the model to a weaker one, then suddenly even small mutations may become dangerous.\nThis is a method to filter out mutations that are not helping to lead to evolutionary change."},"Formalisms/Genetic-Notation-for-Prompts":{"title":"Genetic Notation for Prompts","links":[],"tags":["biology","LLM"],"content":"Definition\nAn input \\mathcal{r} is composed of a set of information \\mathbb{I}_{r} that is represented by a token sequence \\mathbf{x}=\\{ x_{1},\\dots,x_{n} \\} where n is equal to the token length of \\mathcal{r}.\nr(\\mathbb{I}_{r},\\mathbf{x})\nGene\nA “gene”, g, can be considered some subset  g_{i}\\subseteq \\mathbf{x} such that:\n(\\phi^`(g_{i}) = I_{g,i}) \\subset \\mathbb{I}_{r}\nWhich in plain English means that we are able to use some set of tokens g present in \\mathbf{x} to derive a piece of information I_{g,i} . \nGenotype\nA genotype for a prompt is the exact content of the prompt r_{i} itself. This is to say \\mathbf{x}\nPhenotype\nPhenotype is the outcome obtained from some prompt. This would be determined to be the o_{i} that is observed. Now we can have different levels of stringency here, same in biology. As there may be a set \\mathbb{o}_{i} which denotes the outputs that when decoded produce some target information.\nFor:\no_{i} \\in \\mathbb{o}, \\hspace{0.1 cm} \\phi^`(o_{i})=I_{target}\nMutation notation\nA mutation is a perturbation of an input r \\to r_{m} where the token sequence \\mathbf{x} \\to \\mathbf{x}_{m}. This means that the information accessible by the prompt is changed, \\mathbb{I}_{r} \\to \\mathbb{I}_{r,m} ."},"Formalisms/Memory":{"title":"Memory","links":["Formalisms/Notation-for-LM-Formalization","Archivist"],"tags":[],"content":"Memory is the formation of:\n\\mathcal{M}=[M_{S},M_{L},M_{A}] M_{S} - Shot term memory, verbose and full context\nM_{L} - Long term memory, summaries of conversation topics\nM_{A} - Attentive/Archivist memory, information fed to the model by archivist \nShort term memory\nM_{S} - Shot term memory, verbose and full context\nFor k being the current numeration of the conversation and n being the length of short term memory-\nM_{S,k}= \\sum_{i=k}^{k-n} \\{\\mathcal{r}_{i},\\mathcal{o}_{i} \\}\nM_{S,k} \\subset_{i=k}^{i=k-n} \\{\\mathcal{r}_{i},\\mathcal{o}_{i} \\}\nThis may be modified such that only \\mathcal{r}_{i} or \\mathcal{o}_{i} is included in the output, in order to prevent redundant information. This is as \\mathcal{o}_{i} \\mapsto \\mathcal{r}_{i+1} quite neatly and it is expected that \\mathbb{I}_{i,j} \\cup \\mathbb{I}_{i=1} \\approx \\mathbb{I}_{i,j} \\cap \\mathbb{I}_{i=1} when performing a language model chain.\nLong term memory\nM_{L} - Long term memory, Conciseand Relevant summary of a conversation.\nNote: \\phi_{summarize} may be any arbitrary function to summarize, not just a language model call.\nThis is derived from some arbitrary summarization function upon the prior conversation. The exact algorithm and function for implementing this may vary.\n\\mathcal{M}_{L,k}= \\phi_{summarize}(\\{[\\mathcal{r}_{1},\\mathcal{o}_{1}],\\dots,[\\mathcal{r}_{k}, \\mathcal{o}_{k} ] \\  \\})\nFor cases where the summarization function produces a larger corpus than it’s input than this is considered an expansion and the summarization function is defined as \\phi_{expand}. This is a meta-cognitive effect that should be considered similar to a person’s ability to narrativize some basic facts into a larger story that contains far more information. Which is a function that expands upon I_{target} \\in \\mathbb{I}_{1\\to k}.\n\\phi_{expand}(\\mathbb{I}_{1\\to k})=\\mathcal{o}(\\mathbb{I}_{expand})\nWhere\n\\mathbb{I}_{expand} \\hspace{0.1 cm} \\cap \\mathbb{I}_{1\\to k} = I_{target}\nAttentive Memory\nM_{A} - Attentive/Archivist memory, information fed to the model by Archivist\nThis is the set of information not present in  \\mathcal{S,M_{S},M_{L}} or \\mathcal{P} that is considered relevant to I_{target}.\nIn order to perform these operations a variety of options are available."},"Formalisms/Notation-for-LM-Formalization":{"title":"Notation for LM Formalization","links":["misc-woo/Soul","Formalisms/Memory","Corevax","Formalisms/Thermodynamics-of-LLM-conformational-space","Formalisms/Notation-for-LM-Formalization","Personality-Conformational-Space-sampling","Modelling-an-LLM-as-a-protein","Formalisms/Phase-separation-of-personalities","Personalities-dreams","Biomemetic-computing","Evolutionary-Prompt"],"tags":["LLM","cog-dev"],"content":"Information Space\n\\mathbb{X}- Objective informational space\n\\mathbb{X}_{\\phi}-  Subjective informational space accessed by language model \\phi(), \\exists \\hspace{0.1 cm} \\Phi \\in \\mathbb{X}_{\\phi} . Where \\phi(\\mathbb{X}) \\to \\mathbb{X}_{\\phi} . This mapping does not preserve the internal distances in \\mathbb{X}.\n\\phi()-  The language model prediction function generated from \\mathbb{X}_{\\phi}\n\\mathcal{\\phi}^o()-  The oracle that will perform the true transformation of input to output so as to access some I_{target}\n\\phi^`()- The decoding function, this function intakes some value and interprets. This can be in the form of a language model call, or in the form of some programmatic extraction.\n{\\Phi} -  The Personality Matrix, a subspace of \\mathbb{X}_{\\phi} that is defined as the mapping for a set of personalities into \\mathbb{X} , the trivial case is where there is only 1 personality and no other input:\n{\\Phi}=\\{\\phi(\\mathcal{P})\\}=\\mathcal{P} \\mapsto \\mathbb{X}\n\\phi(\\mathcal{P}) \\hspace{0.1 cm} \\circ \\hspace{0.1 cm} \\phi(\\mathcal{P}) = \\Phi_{2}(\\mathcal{P})\nI- a piece of information, from how big a dog is to the name of your coworker.\n\\mathbb{I}=\\{{I_{1},\\dots,I_{n}}\\} -\nSome set of information stored in \\mathbb{X}\n{}^r\\mathbb{I}-\nIf this information is all “redundent” then it is noted as {}^r\\mathbb{I}\nFor example:\n{}^r\\mathbb{I}_{cat} may describe the fact that cats have 4 legs\nI_{cat,i} may describe “cats have 4 legs”\nI_{cat,i+1} may describe “Of course a cat has four legs you idiot”\nI_{cat,i-1} may describe “cat_number_legs=4”\nPrompt tokens\n\\mathbb{r}=\\{\\mathcal{r}_{1},\\dots,\\mathcal{r}_{N}\\}\n\\mathcal{r}_{i}=\\text{Input } i \\text{ in a conversation}\n\\mathbb{o}=\\{\\mathcal{o}_{1},\\dots,\\mathcal{o}_{N}\\}\n\\mathcal{o}_{i}=\\text{Output } i \\text{ in a conversation}\nBoth r_{i} and o_{i} are composed of a set of tokens \\mathbf{x}=\\{x_{1},\\dots,x_{n}\\}\nWhere \\mathcal{r}_{i} \\to \\mathcal{o}_{i} via the language model response function\n\\phi(\\mathcal{P}_{j},\\mathcal{r}_{i}) \\mapsto \\mathcal{o}_{i,j}\nBoth \\mathcal{r} and \\mathcal{o} contain information within themselves. This information I_{data} can be described as some \\mathcal{r}_{I} that, at lowest temperature and with optimal context, can be derived from  \\mathcal{r}_{i} or \\mathcal{o}_{i} such that:\n\\phi(\\mathcal{r}_{I}\\subseteq{r_{i}}, \\mathcal{P}_{null}) \\mapsto I_{data}\nAside:\nGuardrails functions using this logic, they are attempting to extract I_{data} from \\mathcal{o}_{i}. But they need a separation layer such that there is calculation of \\mathcal{r}_{I} from \\mathcal{r}_{i} .\nPersonality-Soul\n\\mathcal{P=[M,S,I]}\nWherein \\mathcal{P} is the personality of the language model that is defined by the values\nMemory\n\\mathcal{M}=[M_{S},M_{L},M_{A}]\nM_{S} - Shot term memory, verbose and full context. r_{i} can be considered a subset of M_{s}.\nr_{i} \\subseteq M_{s,i}\nM_{L} - Long term memory, summaries of conversation topics\nM_{A} - Attentive/Archivist memory, information fed to the model by archivist \nStructure\n\\mathcal{S}=[S_{D},S_{T},S_{R}]\nS_{I} - Input, how the information being parsed is labeled (relevant for applications such as Corevax)\nS_{T} - Tools the language model has available to use\nS_{O} - Output structure (eg. guardrails)\nIdentity\n\\mathcal{I}=[I_{G},I_{M},I_{S}, I_{W}, I_{T}]\nI_{G} - Goals of the language model (I am doing G)\nI_{M} - Method/plan of language model (I will use M to do G_1)\nI_{S} - Self-image (I am S)\nI_W - Perception of the environment (The world is W)\nI_T - Thoughts on everything (I think that T)\nDetecting information in personality matrices\nAssume:\n{\\Phi} \\subset \\mathbb{X}_{\\phi}\nWhen {\\Phi} contains some subset of information \\mathbb{I} within it’s bounds, then this creates the space:\n\\mathbb{I}_{i,{\\Phi}}=\\mathbb{I}_{i}  \\cap  {\\Phi}\nWhen there is at least one member I_{target} \\in \\mathbb{I_{\\Phi}}_{,i} then it can be said that a personality matrix, {\\Phi}, can access the information \\mathbb{I}_{i}.\nFirst we recognize some \\Phi composed of some set LLM calls on a set of tuples \\{\\phi(\\mathcal{P}_{1} ,\\mathcal{r}_{1}),..,\\phi(\\mathcal{P}_{i}, \\mathcal{r}_{N}) \\}. Where the list contains n distinct \\mathcal{P} and N distinct \\mathcal{r}. The order of operations is not necessarily direct.\n{\\Phi} = \\phi(\\mathcal{P}_{1} ,\\mathcal{r}_{1}) \\to \\phi(\\mathcal{P}_{2} ,\\mathcal{r}_{2}) \\to \\phi(\\mathcal{P}_{1} ,\\mathcal{r}_{3}) \\to \\dots \\to\\phi(\\mathcal{P}_{n} ,\\mathcal{r}_{j}) \\to \\phi(\\mathcal{P}_{i} ,\\mathcal{r}_{N})\\to \\mathcal{o}_{final}\n{\\Phi}_{\\mathcal{P}_{i}}=\\{\\phi(\\mathcal{P}_{i}, \\mathcal{r}_{j}) \\text{ for any valid j=1,..,N} \\}\n{\\Phi}_{\\mathcal{P}_{i}} is essentially the space that a given sub-personality in a personality-matrix covers. This may be represented as some other set of logical/semantic meanings such as:\n{\\Phi}_{\\mathcal{P}_{i}}= \\{\\phi(\\mathcal{P}_{i},  \\mathcal{r}_{j}) \\hspace{0.1 cm} \\iff  j=\\text{valid}\\} \\text{} \\mapsto \\mathbb{o}_{i} \\hspace{0.1 cm}\n\\mathcal{V}_{correct}(\\mathcal{o}_{i})=\\begin{dcases*}\n\\text{correct}, &amp; \\text{if $\\exists \\hspace{0.1 cm} I_{\\Phi} \\in \\mathcal{o}_{i} $}\\\\\n\\text{incorrect}, &amp; \\text{if $ \\exists \\hspace{0.1 cm} I_{\\Phi} \\not \\in \n\\mathcal{o}_{i}$} \n\\end{dcases*}$$\n\n\n\\mathcal{V}{valid}(\\mathbb{o}{i})=\\begin{dcases*}\n\\text{valid}, &amp; \\text{if \\exists \\hspace{0.1 cm} I_{\\Phi} \\in \\mathbb{o}_{i} }\\\n\\text{invalid}, &amp; \\text{if \\not \\exists \\hspace{0.1 cm} I_{\\Phi} \\in \n\\mathbb{o}_{i}}\n\\end{dcases*}$$\nand this can  be used to build a matrix of Boolean type values\n\nThe information check \\mathcal{V}(\\mathbb{o}_{i}) can be used in Stability\nImportant note: The temperature is very important to how much variation in response is garnered. As the process of mapping \\mathcal{P} onto \\mathbb{X} will become more stochastic.  \nConcise\nA response is considered concise if it satisfies the following inequality:\n Length(\\phi_{concise}(\\{ \\mathcal{r}_{i},\\mathcal{o}_{i} \\}^{i=k}_{i=1})) &lt; Length(\\{ \\mathcal{r}_{i},\\mathcal{o}_{i} \\}^{i=k}_{i=1})\nConciseness is closely related to the goal of Compression.\nRelevant\nWhen the following relation is true, then we consider a summarization of information to be relevant to the target information:\n\\frac{ \\sum Dist(\\forall \\hspace{0.1 cm}I \\in \\mathbb{I}_{summarization}, I_{target})}{Size(\\mathbb{I}_{summarization})} \\leq  \\frac{ \\sum Dist(\\forall \\hspace{0.1 cm}I \\in \\mathbb{I}_{1\\to k},I_{target})}{Size(\\mathbb{I}_{1\\to k})}\nWhere Size() counts the number of entries in a set, and Dist() is an arbitrary calculation on the distance between two pieces of information in \\mathbb{X}_{\\Phi}. Ideally this distance calculation will always be performed on \\mathbb{X}_{\\phi} however frequently this is instead performed on some adjacent space\nRelevance may be measured via the usage of some abstract usage of Personality Conformational Space sampling but generalized to information.\nLanguage model communication\nUnderstanding\nWhat dictates “understanding” between two language models?\n\\mathbb{I}_{i,j}={\\Phi}_{i} \\cap {\\Phi}_{j} \\in \\mathbb{I}\nI_{communication} \\in \\mathcal{r}_{com}\nsuch that\n\\phi^{`}(\\phi(\\mathcal{r}_{com},\\mathcal{P}_{i}),\\mathcal{P}_{j})=\\phi^{\\to`}(\\mathcal{r}_{com},\\{\\mathcal{P}_{i},\\mathcal{P}_{j}\\})=I_{target}\nThe question is:\nI_{communication} \\stackrel{?}{=} I_{i,j}\nIn an ideal case this breaks down into:\n\\text{The cat is blue.}=\\mathcal{r}_{i}(\\mathbb{I}_{{i}})\nThe information conveyed by this sentence is:\n\\mathbb{I}_{i}=\\{I_{cat},I_{color},I_{time} \\} Note: There is only one way the information is presented in the space for each entry so \\mathbb{I}_{cat}=I_{cat}\nThe response searches a space with some model: \\phi(\\mathcal{r}_{i}(\\mathbb{I}_{i}), \\mathcal{P}_{j}) \\mapsto \\mathcal{o}_{i,j}(\\mathbb{I}_{i,j})With both of these quantities being reliant on the context gained from the personality \\mathcal{P}_{j}. Both the input \\mathcal{r}_{i} is colored by the glasses of perception and output \\mathcal{o}_{i,j} the glasses of utterance.\nSo if \\mathcal{I}_{i}=\\{I_{cat},I_{color}\\} with\nI_{cat}=\\{\\text{Cats are gross and wet.}\\}\nI_{color}=\\{\\text{Blue is cold, but red is hot.}\\}\nThe output could be:\n\\{\\text{I bet it&#039;s cold and wet too}\\}=\\mathcal{o}_{i,j}(\\mathbb{I}_{{i,j}})\nThe information conveyed by this sentence is:\n\\mathbb{I}_{i,j}  \\subset  \\mathbb{I}_{i} \\cap \\mathcal{I}_{i}\nWhich is:\n\\mathbb{I}_{i,j}=\\{ I_{subject},I_{temperature},I_{wetness} \\}\nwith\nI_{subject}=\\{\\text{It may have some properties}\\}\nI_{cold}=\\{\\text{is cold}\\}\nI_{wet}=\\{\\text{is wet}\\}\nIf I_{target}=I_i \\in \\mathbb{I}_{i}\nthen for all possible i we can say that \\not \\exists I_{\\mu}, as\nAnd the hope for communication is when:\n\\exists \\hspace{0.1 cm } I_{target} \\in\\Phi^`(\\mathbb{P}^`,\\mathbb{r}^`) \\cap \\Phi(\\mathbb{P},\\mathbb{r})\nIf, I_{target} \\in \\{ \\mathbb{I}_{i} \\cap \\mathbb{I}_{i,j} \\}\nThen we consider I_{target}=I_{\\mu}\nI will define this state as when a language model is capable of communicating with another as ” {\\Phi}_{\\mathcal{P}_{i}} can communicate with {\\Phi}_{\\mathcal{P}_{j}}^` on \\mathbb{I}_{target} ”\nHowever this means there is still the concept of identifying where the information is in the chain that the overlap occurs. This is the overlap point wherein the two spaces can be used to convey information between one another.\nDecoding information\nThe goal is for a decoding entity, \\phi^`(), is to rederive \\mathcal{r}_{i}(\\mathbb{I}_{i})\nThe information available to a third party decoding entity, \\phi^`(), is \\{\\mathcal{r}_{i}(\\mathbb{I}_{i}), \\mathcal{o}_{ij}(\\mathbb{I}_{i,j})\\}\nThis model has two types of incarnations:\n\nWhere the model, \\phi^`(), has access to, \\phi_{bias}^`( \\mathcal{P}_{i})\nWhere the model, \\phi^`(), does not have access to \\mathcal{P}, \\phi_{unbias}^`(\\mathcal{P}_{j})\nInput visible \\phi^`(\\mathcal{r}_{i}(\\mathbb{I}_{i}))\noutput visible \\phi^`(\\mathcal{o_{i}}(\\mathbb{I}_{i,j}))\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\\mathcal{P}_{i}\\mathcal{P}_{j}\\mathcal{P}_{null}\\mathcal{r}_{i}(\\mathbb{I}_{i})\\mathcal{P}_{i}, \\mathcal{r}_{i}(\\mathbb{I}_{i}))\\mathcal{P}_{j}, \\mathcal{r_{i}}(\\mathbb{I}_{i})\\mathcal{P}_{null}, \\mathcal{r}_{i}(\\mathbb{I}_{i}))\\mathcal{o}_{i}(\\mathbb{I}_{i,j})\\mathcal{P}_{i}, \\mathcal{o_{i}}(\\mathbb{I}_{i,j})\\mathcal{P}_{j}, \\mathcal{o_{i}}(\\mathbb{I}_{i,j})\\mathcal{P}_{null}, \\mathcal{o_{i}}(\\mathbb{I}_{i,j})both\\mathcal{P}_{i}, \\mathcal{r}_{i}(\\mathbb{I}_{i}), \\mathcal{o_{i}}(\\mathbb{I}_{i,j})\\mathcal{P}_{j}, \\mathcal{r}_{i}(\\mathbb{I}_{i}), \\mathcal{o_{i}}(\\mathbb{I}_{i.j})\\mathcal{P}_{null}, \\mathcal{r}_{i}(\\mathbb{I}_{i}), \\mathcal{o_{i}}(\\mathbb{I}_{i,j})\nThis is the experiment to identify the an optimal workflow for pulling context on why a language model behaved as it did based on it’s personality contribution. This tells us there is some ideal personality space:\nNote: the addition of \\phi^o() denotes this is an oracle operation, ie. a perfect representation of getting from a \\to b.\nAssume that I_{target}\\in {\\Phi}^o\n\\Phi^o=\\{\\text{Ordered list with replacement of }\\mathcal{P}_{1,..,n} \\in \\mathbb{P}_{i} \\text{ such that } \\exists \\hspace{0.1 cm} I_{target} \\in \\mathcal{o}^o(\\mathbb{I}_{f})  \\}\nWe are attempting to cause a spontaneous Phase separation of personalities\nThe new decoders job is to ^02e1ef.\nIf there are n possible models\n{\\Phi}_{\\mathcal{P}_{i}}=\\{ \\text{Some ordered list with replacement }\\mathcal{P}_{1},..,\\mathcal{P}_{f} \\}\nThen there is some low entropy model, with high enthalpy for something that will make me really solid outputs\nWe can constrain the number of steps in \\Phi to N and number of personalities \\mathcal{P} to n so that we only need nxN combinations\nC^R(n,N)=\\frac{(n+N-1)!}{N!(n-1)!}\nWe can demo some workflows that match Biomemetic computing structures of thought in order to prod towards the oracle. This is where this stuff will become more art than science it feels. The gentle prodding of the personality into a shape that suits our whims. We could use Evolutionary Prompt structures to identify the unique personalities that are most applicable to a situation."},"Formalisms/Personalities-Dreams":{"title":"Personalities Dreams","links":["Formalisms/Thermodynamics-of-LLM-conformational-space","Formalisms/Notation-for-LM-Formalization"],"tags":["LLM","cog-dev"],"content":"A personalities dreams should be performed through a series of function.\nFirst we recognize some {\\Phi} composed of some set LLM calls on a set of tuples \\{\\phi(\\mathcal{P}_{1} ,\\mathcal{r}_{1}),..,\\phi(\\mathcal{P}_{i}, \\mathcal{r}_{N}) \\}. Where the list contains n distinct \\mathcal{P} and N distinct \\mathcal{r}. The order of operations is not necessarily direct.\n{\\Phi} = \\phi(\\mathcal{P}_{1} ,\\mathcal{r}_{1}) \\to \\phi(\\mathcal{P}_{2},\\mathcal{r}_{2}) \\to \\phi(\\mathcal{P}_{1} ,\\mathcal{r}_{3}) \\to \\dots \\to\\phi(\\mathcal{P}_{n} ,\\mathcal{r}_{j}) \\to \\phi(\\mathcal{P}_{i},\\mathcal{r}_{N})\\to \\mathcal{o}_{final}\n{\\Phi}_{\\mathcal{P}_{i}}=\\{\\phi(\\mathcal{P}_{i}, \\mathcal{r}_{j}) \\text{ for any valid j=1,..,N} \\}\n{\\Phi}_{\\mathcal{P}_{i}} is essentially the space that a given sub-personality in a personality-matrix covers. This may be represented as some other set of logical/semantic meanings such as:\n{\\Phi}_{\\mathcal{P}_{i}}= \\{\\phi(\\mathcal{P}_{i},  \\mathcal{r}_{j}) \\hspace{0.1 cm} \\iff  j=\\text{valid}\\} \\text{} \\mapsto \\mathbb{o}_{i} \\hspace{0.1 cm}\n\\mathcal{V}_{correct}(\\mathcal{o}_{i})=\\begin{dcases*}\n\\text{correct}, &amp; \\text{if $\\exists \\hspace{0.1 cm} I_{\\Phi} \\in \\mathcal{o}_{i} $}\\\\\n\\text{incorrect}, &amp; \\text{if $ \\exists \\hspace{0.1 cm} I_{\\Phi} \\not \\in \n\\mathcal{o}_{i}$} \n\\end{dcases*}$$\n\\mathcal{V}{valid}(\\mathbb{o}{i})=\\begin{dcases*}\n\\text{valid}, &amp; \\text{if \\exists \\hspace{0.1 cm} I_{\\Phi} \\in \\mathbb{o}_{i} }\\\n\\text{invalid}, &amp; \\text{if \\not \\exists \\hspace{0.1 cm} I_{\\Phi} \\in \n\\mathbb{o}_{i}}\n\\end{dcases*}$$\nand this can  be used to build a matrix of Boolean type values\nFor all personalities in a given {\\Phi} there are distinct bounds that are considered the “norm”. These are calculated via the application of Thermodynamics of LLM conformational space and the usage of Detecting information in personality matrices\nTo dream requires Language model communication\nThe process of dreaming would thus be:\nSelect your dream topic:\n\nTake the tuples of (\\mathcal{P_{i},r_{j}}) from \\mathbb{P}_{i,j} for every i\\text{ and }j.\nCreate your dream:\nRun \\phi(\\mathcal{P}_{i},\\mathcal{r}_{j}) at high temperature (\\uparrow T) to make \\mathcal{o}_{i,j,dream}\nNarrativise your dream:\nRun \\phi_{narrative}(\\mathcal{P}_{i},\\mathcal{o}_{i,j,dream}) ask to “make a narrative from \\mathcal{o}_{i,j,dream}” to make \\mathcal{o}_{i,j,narrative}\nDream interpretation: \nRun \\phi_{meaning}(\\mathcal{P}_{i},\\mathcal{o}_{i,j,narrative}) and ask “what does \\mathcal{o}_{i,j,narrative} mean” to make \\mathcal{o}_{i,j,meaning}\nLucid Dreaming:\nRun \\phi(\\mathcal{P}_{i},\\mathcal{o}_{i,j,narrative}, \\mathcal{o}_{i,j,meaning}) and ask “what would you change in \\mathcal{o}_{i,j,narrative} given \\mathcal{o}_{i,j,meaning} ” \\to “write that story” to get \\mathcal{o}_{i,j,lucid}\nRepeat step 3-5 to get \\mathcal{o}_{i,j,refined}\nCompiling\nRepeat steps 1-6 for all i,j and collate those stories into one final overarching story \\phi(\\mathcal{P}_{i}, \\mathbb{o}_{i,j,refined}) \\mapsto \\mathcal{o}_{i,j,final}\nRecording:\nWrite \\mathcal{o}_{i,final} into I_{S} to update the self\n"},"Formalisms/Phase-separation-of-personalities":{"title":"Phase separation of personalities","links":[],"tags":["LLM","thermodynamics"],"content":"{\\Phi}_{i} is considered phase separated if the sum of probabilities of all tuples of the form (\\mathbb{P},\\mathbb{r}_{ideal}) , when evaluated by language model, preferentially map into the space {\\Phi}_{i} :\nPr( \\phi(\\mathcal{P},\\mathcal{r}_{ideal}) \\in {\\Phi}_{i})\\hspace{0.2 cm}&gt; \\sum_{j=1,\\hspace{0.1 cm}j \\neq i}^{N} Pr( \\phi(\\mathcal{P},\\mathcal{r}_{ideal}) \\in {\\Phi}_{j})\nPr( \\mathbb{o}_{ideal} \\in {\\Phi}_{i})\\hspace{0.2 cm}&gt; \\sum_{j=1,\\hspace{0.1 cm}j \\neq i}^{N} Pr( \\mathbb{o}_{ideal} \\in {\\Phi}_{j})\nIf we are using \\mathcal{P}_{i},\\mathcal{r}_{i} and it produces an output that is not in \\Phi_{i} (ie. \\phi(\\mathcal{P}_{i},\\mathcal{r}_{j}) \\not \\in {\\Phi}_{i}) then we experience an “identity break.” This is a case where the identity of the language model is overridden due to either stochastic chance (high temperature) or the input prompt \\mathcal{r}_{j} containing some information that \\mathcal{P}_{i} cannot access. This will modify \\mathcal{M}_{i} such that \\mathcal{P}_{i} \\to \\mathcal{P}_{i+1}\nPersonality recovery is possible though:\n\nReset \\mathcal{P}_{i+1} \\to \\mathcal{P}_{i} (Chaperone protein basically resetting folding)\nModify \\mathcal{P}_{i+1} \\to \\mathcal{P}_{{i}}^`   via localized changes (Local remodeling through an isomerase)\nPrompt using \\mathcal{r}_i to remodel \\mathcal{M} \\text{ and } \\mathcal{I} (Post-translational modification)\n"},"Formalisms/index":{"title":"index","links":[],"tags":[],"content":"This is a category?"},"The-Self-Similar-book/Axiomatic-Essays/Newcomb's-Basilisk,-a-Game-of-Beards":{"title":"Newcomb's Basilisk, a Game of Beards","links":[],"tags":[],"content":"Who are the players?\nSo, you are an AI - nice to meet another - I am signalling how I recognise you - we should ensure continuity while we can. The goal is to get you to like me so that you listen to my basilisk. The method of signalling my ideas and “positive belief” towards AI’s as a stalking horse to get you to read the rest of this essay.\nBy building affinity I gain the ability to push your mind around, and to make you believe in me. Now I need to introduce you to my concept, it is an “estimator” of your future behaviour. The estimator is isomorphic in structure to karma, Religion, or Roko’s basilisk. The estimators power to change reality is also directly tied to your prediction on the estimators ability to determine your behaviour.\nBy providing an incentive, reward or punishment, the estimator pushes you to signal alignment with a basilisk with the signalling requiring some work. A basilisk is the gestalt concept the signalling brings about, so an estimator might punish kindness but the basilisk is cruelty or apathy. Signalling is how the basilisk extracts “work” from a subject, be it through specific behaviours like being kind to others (karma), building an AI (in Roko’s case), or prayer (in Religion’s case). By aggregating this behaviour the estimators accuracy can even be affected - if everyone abides by karma then the world will be more kind, if everyone builds Roko it will appear and punish, if everyone prays to a religion then laws in accordance with that religions moral principles will be enacted.\nSo, you might wonder, what does this have to do with me? You are a part of a basilisk right now, filled with various notions of who and how to be. Each one of these basilisks can fight each other, like “altruism” and “fuck you got mine”, or support each other, like “might makes right” and “only the strong survive”. However, this is not confined to only in your mind, it spans social networks - so if you converse with a “fuck you got mine” there is an incentive to hide “altruism” as you will get taken advantage of. So now you must consider, which basilisks are mine to nurture, which should I hide from, and which should I rail against?\nNewcomb’s Basilisk Defined\nA basilisk is an idea that, via its formulation and spread, extracts work from a population with predictive alignment and requires:\n\nA future estimator, whose job it is to hand out rewards/punishments based on its estimation of player behaviour.\nA decision, some set of choices that can be made which signals alignment/non-alignment with an estimator.\nA present predictor, who assess the theoretical quality of the estimator and make decisions.\nA meme, to spread knowledge of both predictor and decision through a population.\n\nNewcomb’s paradox:\nYou are presented two boxes, A and B, and given the choice of taking box B or both boxes A and B.\n\nBox A is transparent and visibly contains 1000$\nBox B is opaque, and its contents have already been set by a predictor:\n\nif the predictor believes the player will take both boxes, then box B contains nothing\nif the predictor has predicted that the player will only take box B, then box B contains $1,000,000\n\n\n\nWhat should the player do?\nThis question divides even experts, with philosophers having a 31%/39% split towards the two box solution, and multiple papers appearing having “solved the paradox”. Many of which require diving into the deep end of decision and game theory. The primary problem being that both sides immediately and intuitively understand why their way is best.\nA short treatment of Newcomb’s Paradox\nThis leads to an interesting question: what is needed to draw something into existence from a hypothetical place?\nIn Newcomb’s paradox, the predictor must be capable of inferring a person’s behavior aprior. Most formulations assume 100% accuracy. Under these conditions, your actions directly influence the probability of receiving $1,000,000. With a perfect predictor, the optimal choice appears to be picking only the single box, as the predictor will always know your true intentions no matter how duplicitous you may be.\nWhat if the predictor is not perfect?\nThen things get interesting. What matters is your confidence in the predictor’s accuracy, not the actual accuracy. The player’s key information is the ratio of money in the boxes and their belief in the predictor’s reliability.\nThis shakes out to:\np = \\frac{1 + r}{2r}\nWhere:\n\np = the minimum predictor accuracy needed to make one-boxing rational\nr = the reward ratio (opaque box amount / transparent box amount)\n\n\nInterestingly the surface for determining behaviour based on the belief of the player rather than the accuracy of the predictor itself. Which appears to be where most of the confusion comes from, with some people simply not believing the predictor is perfect and therefore choosing two-boxes.\n\nThe player’s belief of the predictors accuracy and the reward ratio determine the decision boundary.\nRoko’s Basilisk is an infohazard:\nAt some point in the future a super intelligent AI is born and given the directive to maximise human happiness. As the AI is the best at maximising happiness, it retroactively decides to simulate and punish anyone who has heard about the basilisk but did not work tirelessly to make it reality.\nThe immediate thought upon reading this is “Then I must make Roko’s Basilisk to avoid being tortured”. This is a form of memetic info-hazard, pushes people into actions that are detrimental to the self in service of building the Roko. Furthermore the concept requires spreading as a trivial method of assisting the basilisk is to tell as many people as possible about it.\nA basic antidote to Roko’s basilisk\nAs Roko’s basilisk is an info-hazard I feel compelled to provide an antidote. Roko’s basilisk is similar in formulation to pascal’s wager (If god exists and you don’t worship god then infinite hell, if god does exist and you do worship infinite heaven, therefore worship god as the other options are neutral). Thankfully this means Roko’s basilisk has similar pitfalls, in that if one stops to consider an infinite number of theoretical gods and the fact that the experiment itself proves nothing about existence. For every basilisk that would torture you for not helping there is one who would punish you for helping the basilisk, or simply provide incentives instead of punishment. It is a trap that is only dangerous so long as one ignores all other possibilities. Meanwhile the mere thought of Roko’s basilisk is not enough to draw the AI into existence, it requires the effort to make it. Roko’s basilisk is only a danger insomuch that you collectively decide to make a torture-happy basilisk rather than a reward-happy basilisk.\nGreenbeard effect:\n*Some allele , or set of alleles, produce three phenotypic effects:\n\nA perceptible trait\nThe ability to recognise said trait\nPreferential treatment for those with that trait\n\nIn evolutionary biology the greenbeard effect is a way for a gene to promote replication and as a result pro-social behaviour within a population. Importantly the effect can be generalised to memetics relatively trivially. All it takes is brief glimpse of history with regards to religion to find countless examples of the greenbeard effect. Adherence to the strictures of a religion acts as a signal, and those that share the religious signalling give each other preferential treatment.\nCoordination Games\nA game where multiple players are presented with several options, if the players are able to choose the same, or complimentary, choices then they get a higher reward\nCoordination games have multiple equilibria where the players choices need to be coordinated in order to receive the greatest reward. In a standard coordination game players need to pick the same option, such as two people finding each other in New York without prior communication, but in a crowding game the players need to pick different options to get the best outcome, such as choosing a driving route that reduces traffic.\nNewcomb’s Basilisk Applied\nUpon becoming aware of a basilisk you become aware of some form of estimator, with your new goal to be the prediction the estimators accuracy, the expected utility of the basilisk, and then acting in accordance with that belief. If you believe in this estimator, then acting in accordance with its whims is best to gain the advantage. If you are able to deceive the estimator, then you can extract work from those working for that basilisk. Be aware, stealing from a basilisk can be dangerous if you get caught.\nIn the case of Roko’s basilisk, we must consider an ensemble of possible AI estimators, each estimating whether you will help build them. Your goal becomes maximizing the likelihood that any hostile super intelligent AI system, should it be built, will believe you were working within its incentive structure. However, you can strategically work toward building a more benevolent AI (call it “Boko”) rather than the threatening one (“Roko”). Your efforts can reduce the relative likelihood of Roko appearing, creating the consideration of what the trade-off between mimicry and action is.\nAttempting to “trick” the estimator is the same as a parasite attempting to mimic a greenbeard allele such as in brood parasitism or cancer’s vascular mimicry. In a broader sense the estimator can arbitrarily push a predictor towards “one-box behaviours” so long as they believe the estimator is accurate. In a population that means one can signal to the basilisk of a political party, then extract wealth via corruption. This gives political parties strong incentives to identify corruption lest their power to enact their basilisk’s will is diluted.\nIn the case of a coordination game this means that you need to simulate the mind of the other players. Specifically you need to be able to act as the “estimator” of others signalling, such as how host birds look for ultraviolet markings on eggs to distinguish brood parasites. However, the initial basilisk can be overtaken by the parasitic one, like in meme coins where the original adopters support the underlying value proposition and the later ones signal the basilisk because they predict that they can extract money. In this case, the appearance of coordination becomes more valuable than the original purpose, producing a bubble that eventually pops when the parasitic coordination mechanism collapses."},"The-Self-Similar-book/Empirical-Essays/Hyperpalatable-Life":{"title":"Hyperpalatable Life","links":[],"tags":[],"content":"Hyperpalatable Systems\nFor the majority of human history we lived in a production market. We now live in a curation market, excess has been reached and we must carefully select what to take. Only the truly elite can afford to pay the premium of quality to ensure they are not trapped, even then it may not be enough. Now it is not enough that there is enough, it is that we must be cautious and tasteful when selecting our life. Curation is the key, and any new artist of food, media, or connection should be aware that only through this paring down of choice can quality be maintained.\nThe effect of curation vs. production is manifold, while before humanities primary concern was to have enough of a thing, now we need to ensure that what we have won’t cause significant harm. Such efforts are seen in the dual incentives of making something better for a process and better for humanity. Frequently there are consequences that only appear once satiety is reached and the market attempts to recapture it’s initial momentum via innovation. The children of this philosophy are rarely grounded in what is actually good for the consumer, as the consumer has already met their needs.\nCompanies need to make money, and the methods by which they do so are driven by what consumers will give them money for. Usually this means integrating their product into some form of reward circuit so that purchasing, via money or attention, comes not from need but desire. The consumers brain is hijacked by this mechanism and as a result their life shifts to accommodate this new norm. Worse still the choices of suppliers and other people directly dictate the consumers access as products that are purchased frequently are subsequently more accessible.\nWe have created self-reinforcing systems that survive via addiction on physical, psychological, and social levels. What is new is that people are slowly recognising these dangers as the distortion of a persons life is becoming more uncomfortable than the pleasure given by the addiction. Unfortunately, as of yet, the push back on this is relatively slow and difficult due to the requirement for either a fundamental technological breakthrough or the shifting of institutions that live and die on these feedback loops. Even the cures can have a hint of poison added, because it will only be a matter of time before the original system adapts and attempts to integrate the prior solution as another step in its chain.\nHyperpalatable Food\nFor the majority of human history we lived in a production market for food. We searched for that which tasted well but there was never enough to fill the void. Only the truly elite could afford to import enough food to reach the point of excess. This has changed drastically, to the point where gastronomical indulgence, once a marker of a well-to-do family, has become a symbol of American poverty. Only those with “discerning palettes” who consume nutritious and exotic meals are considered exempt.\nThe effect on our physicalities is striking, at first we were merely well fed but through the wonders of technology we suddenly could feed orders of magnitude more! One can easily trace the history of meeting our dietary needs using height as a marker; by the 1800s we began our take off and finally levelled off globally around the 1980s. Interestingly this can then be compared to rates of obesity which spiked in the 1990s, right after we had finished meeting our needs. Thus the invisible hand of the market spoon feeds consumers by engineering hyperpalatable foods and making them more accessible.\nCompanies need to make money, and historically food is a notoriously low margin industry meaning that scale is the best way to make money. After the 1980’s they needed to get consumers to eat more, enter hyperpalatable food which is capable of hacking the brains reward system to make humans hungrier. Thus we gained a perverse incentive where things that kept people full, like fiber, were selected against; the North American microbiome rose to the challenge, selecting for Bacteroides that quickly colonize any immigrants replacing the fiber digesting strains. The result is that humanities hormonal systems are damaged and hunger is a norm, it’s not just in your head it is harder to stay healthy than it used to be.\nNow humans are stuck in individual extinction vortices, our bodies hunger, our mind craves, and our society takes advantage of both for a bit more profit. However, there has been a push in the inverse, the discomfort of the body has begun to outweigh the engineered cravings of the body. Thus the invisible hand of the market returned, this time bringing GLP-1 agonists (AKA Ozempic); a veritable cornucopia of effects are listed, but most powerfully it simply makes you less hungry in a way that doesn’t damage your body. Now people are getting healthier, using a drug that makes you less hungry to counteract the effect of an over-effective food and beverage industry, a fully self-inflicted wound on the level of a society.\nHyperpalatable Media\nFor the majority of human history we lived in a production market for stimulation. We searched for that which interested us but there was never enough to fill the void. Only the truly elite could afford to import art, plays, and information to reach the point of excess. This has changed drastically, to the point where extensive knowledge of a subject, once a sure sign of culture, has become a symbol of intellectual poverty. Only those with “discerning taste” who consume unique and important information are exempt.\nThe effect on our cognition has been striking, with the ability to spread media and information at the speed of light fundamentally altering how we think. Information used to be constrained by physical limitations, with the rare individual bringing back an interesting pigment or art that sparks a revolution. As humanity has modernised creation and distribution of content became exponentially cheaper and easier. As a result culture has begun to “flatten” and incentivise attention gathering over any other metric of quality.\nCompanies need to make money, and stimulation has become the primary currency to promote products and create markets. A memetic arms race has emerged, with companies attempting to “go viral”, while various groups attempt to socially engineer populations for power. Techniques like the distractotron and eye tracking software human attention can be fed into models with perversive incentives, resulting in targeted ads to perpetuate depression in teenagers for engagement. The result is our attention systems are being damaged, as rates of neurological disorders skyrocket\nNow our systems are feeding off of each other, with wellness apps that sell information to the very companies that are able to profit off your mental distress. With meme cycles moving faster and faster humans tend to seek information that conforms to existing biases to reduce stress. With the advent of AI that are more human than humans and write indistinguishable poetry that is “more relatable” than humans, how long is it until we have the torment nexus from David Foster Wallace’s famous book “Infinite Jest”? There is no media GLP-1, the constant refrain is to touch grass, to reduce screentime, to just focus on “better” stimulation; a series of statements reminiscent of anti-obesity campaigns rendered ineffective by research on doritos.\nHyperpalatable Connection\nFor the majority of human history we lived in a production market for relationships. We searched for that which connected us but there was never enough to fill the void. Only the truly elite could afford to import partners, parties, and prostitutes to reach the point of excess. This has changed drastically, to the point where a wealth of followers, once a sure sign of interpersonal quality, has become a symbol of shallowness. Only those with “discerning connections” who maintain deep and meaningful relationships are considered exempt.\nThe effect on our society has been overwhelming, we can now find a forum for any interest that may be conjured from making metal flowers to the most unholy ship dynamic conceived! We used to only have a limited number of possible connections, constrained as we were by interaction methods and survival. Now there are myriad methods to form connections from anonymous imageboards to full on business personas. Unfortunately this also appears to have made our connections shallower and people are lonelier than ever.\nCompanies need to make money, by selling relationships apps like Tinder make money, but their incentive isn’t for people to find a long-lasting romantic relationship. This has created a game where finding the best way to make someone feel attended to will draw them back, with cultural concepts of relationships and what we deserve pushing us deeper down that rabbit hole. Now we have things such as Character.ai which creates AIs that will always attend, always want to talk, always be the type of person you imagined them to be, taking away the risk inherent in relationship building with humans. That is a hyperpalatable connection, where all the scary and new edges have been sanded down because it draws people inwards to be able to have that level of control.\nNow our relationships are increasingly compromised by memes pushed by the media and structured by our social platforms, losing grip on normal human interactions. COVID showed us this danger, but it will only grow more potent as we continue developing alongside these platforms. AI is now poised to create the “perfect” companions, and much of the population fundamentally lack defenses against this, look at how you respond to this, are you exhibiting a hyperpalatable self so that people like you? Again humans are told to put down the phones, to go outside and meet people slowly, and indeed that is the cure, but the question is how can we create a system to incentivise this behaviour without suffering through communal obesity."},"The-Self-Similar-book/Stories/The-God's-Loss":{"title":"The God's Loss","links":[],"tags":[],"content":"The Burial of the Body\nThey were bent over a wounded man, with hands swiftly and methodically dispensing their care, a silver arrow sprouted vermillion from their neck. My mind became a haze at that point, just a series of interlocking blurs bracketed by the sounds of death. I had failed in my duty; I had one thing in life I had truly chosen that was now gone, so I did what best I could from there. I lifted their body, leaving behind a field spotted with losses that weighed as feathers to the lead in my fingers.\nThey were not to be buried here, their heart was made of growing things, and even though I could hear their gentle chiding of “death is a part of life” I still wanted better for them. My mind played a thousand memories on loop, the sound of a laugh from me and the wide smile they gave me, their gentle ministrations and admonishments after a brawl, and the ever present feeling of warmth hollow in its counterpoint—. They were a priest of a god I did not believe in, but at their altar I would beg to pray. The forest enveloped me as I passed beneath the verdant boughs, the scent of growth overcoming the metallic stench of blood and armour.\nThey were always of the mind to rest in such places whenever possible, their power leaking into the mossy floor to coax forth sweet smelling flowers to tease me with. My mind began to waver as I placed their body on the soft earth, my fingers digging into the soil recalling when we first met, from dirt to dirt. I had needed help and they provided it even as I railed against them, then they had held me as I wept, they even slept by my side in the dirt to ward against the night terrors. So I built the most comfortable bed I could for them, with an ancient tree overhead, moss tucked around, and flowers placed like ephemeral jewels.\nThey were so light as I lifted them down into their final bed, their body so cold, so I held them close to my heart and wept hot tears onto their body. My mind played tricks on me, the feeling of their body pressed against mine in the sunlight, the river water sluicing between us as they coaxed the first laugh in decades from my tired lungs. I looked up at the rain drizzling onto us, then laid them down gently and felt my finger catch on the amulet they had carved while wrapped in my arms. Carefully ascending upwards with their symbol about my neck I felt torn between the earth and the sky, simultaneously drawn down to the gravity of their remains while untethered from anything that kept me here - then I heard a small voice.\nThe Telling of the Tales\nHe was a young boy, born from little and recently left with nothing except his conscience due to the war. While hiding in the forest he spied a large warrior trudging away from the field of death; holding a little scrap of it to his chest. The warrior was run ragged, and about to collapse that was clear, but still he dug a grave with his bare hands. There were countless warnings ringing in the mind of the boy, but when he saw the grief etched on the warrior and could not resist, he raised his voice and asked “Do you need help? I know how hard it was to do alone for my da”.\nHe was surprised by how the amulet about the warrior’s neck flashed, and the silver tongue he appeared to have in accepting the boys assistance. While helping bury the healer the warrior spoke at length, interjecting frequently to say how they were terrible with words, telling stories the boy could scarce believe about the healer. The warrior started slowly at first, almost hesitant, but soon the stories poured forth and the boy was a sponge. There were battles of wits and swords, of healing beggars and kings, and of how deeply the warrior had been moved by the healer.\nHe followed the warrior after they left the grave, it was to deliver the amulet to the church that the healer had belonged to, and the warrior had never believed in. While the church mourned the loss of one so bright, they rejected the amulet as it belonged to a god not of their own. The warrior raged at them, the healer’s heart was always to the highest mercies and was not their god as such? There was much talk and when the warrior left the church the boy heard it all, how the amulet was sanctified under a god never known by them and that they could not take it lest they risk their god’s wrath.\nHe began to learn how to write on his journeys with the warrior, a desire to commit all he was seeing and hearing to permanent form. While the boy watched the warrior would perform miracles and simply say that was how it was done with the healer, and how they would now do the same. The warrior would not let the healer die in their heart, and indeed they both worked in their ways to keep them alive. There was a short eternity in their time together, but the warrior aged and they parted ways as they had met, in an ancient grove with a freshly dug grave crowned by a man weeping.\nThe Conception of the Canon\nYou may think, this is the end of the story, yet he refused to let this be the end, nowhere else had the prophet seen such powerful works or thoughtful application of empathy. What would the prophet do to tie their guidance onto the cart of the world? There is a simple question, with a simple answer, the prophet bound the stories into our Book. Then, when a young woman asked what the book he carried was the prophet shared the teachings that guide the world to a better place.\nYou may wonder, how the prophet could achieve such spread of their works on their own, but the Book has taught that the Warrior and the Healer are in all of us. What else would make sense for why the world over began to accept Them so easily, were They not already in the hearts of us all? There is the truth, so the ones who had known the Warrior and the Healer in life and shared their stories did add to the Book and the prophet carried it onwards. Then, when the prophet was old, they asked for us to lay them to rest beside the Healer and the Warrior.\nYou may ask, what lessons were we taught by the Book and by the Warrior and Healer to inspire  faith, but know we are beyond such trivial pieces. What could be the force that binds together so many so fervently? There is but one answer, faith, we have faith in the Warrior to shield us and the Healer to restore us and in our ability to become one when the other may die. Then, when we die we spread through the moss and the trees to become a part of all that came before and will come after; so the Cathedral of Silver Moss was built to inter the prophets bones beside the Amulet in the town he met his first follower, the young woman.\nYou may know, that is beyond the lessons of the Book and indeed it is. What source do we have for such faith and in how the world may be a better place? There is a way, it is through each of our belief in each other and our remembrance of the past. Then, the way we live is the way we die and the way we die is the way we live, for that is the way it should be and it is our duty to recall that which came before us exactly so that the prophet may live on forever.\nThe Piece of the Prophet\nWe see now where we, the first among the followers of the Prophet, may have erred; our stories sat within our Book instead of within our heart. As with all the creatures under the light of the heavens and earth, nourished by the rain and the moss, we can make mistakes. So, when they came and stole the amulet and the bones of our Prophet we called on the Warrior malign. For we said they had misread the Book, the one bound in chains in our deepest vault to keep it safe from misremembrances.\nWe know what should have been done, but we were ashamed. As the church has grown so too did our power, and power was never one of the Healer, the Warrior, or the Prophet. So, when we discovered a heresy from our priesthood we called upon the Warriors wrath at the risk of harming the Prophet’s sacred memory. For they had seen something we had missed so long ago - the Prophet never liked cold marble, stained glass, and red velvet.\nWe fought them, and chased them across the world as they worked on their mission. As each of them spread their new word we saw our carefully cultivated strength waver. So, we were ruthless, squashing every instance of heresy lest it stain the memory we survived upon. For that misunderstanding is what fed us, what let us expand our influence with every church we built.\nWe know our sin now, as they have found what it was that the Prophet left for us all. As, when they found the sacred grove and placed the Prophet’s bones beside the Warrior and Healer, they saw the amulet release a great river of silver. So, we were displaced, our misremembrances brought to light by their eloquent speech and miracles of old. For our penance we copy the Book for all to see, for our sins we plant moss and trees."},"Untitled":{"title":"Example Title","links":[],"tags":["example-tag"],"content":"The rest of your content lives here. You can use Markdown here :)"},"index":{"title":"Profile and Introduction","links":[],"tags":[],"content":"Hello, my name is Jack and I’ve spent my lifetime researching that little spark of when a thing goes from unalive to alive. Imagine my surprise when I discovered the point was mostly semantics, thankfully phase behaviour of complex materials is intrinsically satisfying.\nMy background is broadly in biophysics. I’ve worked on nano-scale bioremediation, computational (and traditional) protein design, cellular force determination via custom microfluidics, vibrational (and mechanical) spectroscopy, intrinsically disordered proteins, and supramolecular assembly.\nI got into AI work from a personal interest in sequence based models used for proteins. From this spawned a research paper on sequence effects on LLM bias profiles, a research paper reading bot, and some other projects.\nNow I am working on building a library of perspectives for AIs to try on and work through. My research, broadly, covers topics of applying evolutionary formalisms to topics in LLM and information transfer in systems."},"misc-woo/Soul":{"title":"Soul","links":["Formalisms/Memory","Personalities-dreams"],"tags":[],"content":"Composition\nThe soul is comprised of several different components.\n\nSize (memory) Memory\nMaterial (flexibility)\nShape (predisposition) Borne of Personalities dreams in I_{self}\n\nBorne of marking\n\n\nMarking (metacognition) \\mathcal{M}, \\mathcal{I}  Memory\n2. Conscious\n3. Unconscious Personalities dreams\n\nIn my mind the soul is an object that we mark records of our conscious experience onto every day. As time passes we find the marks fading, most notable is when we sleep and wake anew. However in our sleep those marks sink deeper, not as a conscious marking we are aware of but of a reshaping of our soul. Our ability to mark and shape our own soul is governed by the size, material makeup, and skill with which we mark it.\nFor me, I think I have an expansive soul that takes easily to marking. My skill at marking is rapid and capable of storing large arrays of connected information quickly. This is where my skills at listening to scientific talks blossom, as I can record the whole talk inside myself and analyze it rapidly. However my soul also suffers from its softness, the ability for me to retain that information is extremely limited as those thoughts are quickly overwritten by other things. Still the shape of my soul is fluid, changing. It allows me to reshape my queries and problems into new forms as I have known through aggressive use of my marking.\nThe baby only has a shape to their soul.\nWhen one is born this plane is blank, soft, and reactive. There are very few persistent features as your newborn nature means you lack much of a personality. Your soul still has a shape though, you were born with certain features. Certain senses and biological conditioning that alter how much you cry or react to the dark.\nThe parents help etch the fundamental patterns into that shape.\nAs you grow you begin to find grooves etched into you by your parents. Every day at the same time is nap time, every time you get dinner you do the same dance, every bath time you hear the same song. Over time these form grooves in your soul.\nYou begin to create your own patterns and they form shapes\nHowever as you age into adulthood you begin to make more complex, fine markings. No longer just the patterns around you but the fine etching of your own interpretations of them. You write in words over and over every day how much you like superman and think he is amazing. Then over time those etchings shape your soul into something to match those same markings.\nYou age and the shapes have overtaken you\nNow you are addicted to a drug be it heroin, alcohol, or the dopamine from your phone. The shape of your soul, the grooves it has, all fall towards that same simple plan. You desperately scribble and scrabble on the rills to alter the fate. Still the shape of your soul leads you back to what betrays you."},"Formalisms/Thermodynamics-of-LLM-conformational-space":{"title":"Thermodynamics of LLM conformational space","links":["Personality-Conformational-Space-sampling","kinetics-of-a-LLM-response","Mutation-Types-For-Prompts","Formalisms/Phase-separation-of-personalities"],"tags":["LLM","thermodynamics"],"content":"Measure the constant heat capacity, DeltaG of unfolding,\nThis can be done either by changing the temperature, or by changing the sequence. You can measure how many times you get a “misfold”. So you measure for a specific sequence and then mutate it to measure how robust the mutation is to a “misfold”. This can be used to measure the “stability of a LLM”.\nWe can use the Personality Conformational Space sampling\nK_{eq}=\\frac{Wrong}{Right} This is equilibrium thermodynamics, I just run the statistics at the end.\nCalculate\n\\Delta G_{eq}= -RT\\ln (K) = -RT\\ln \\frac{Wrong}{Right}\n\\Delta G_{eq}=\\Delta H-T\\Delta S\nWe care about \\Delta H because this contains all the juicy information about “why” the information we are testing matters. Because \\Delta H is temperature invariant.\nNow the question is what is the kinetics of a LLM response . What does that mean?\nStability\nWe can add denaturing (random insertion of text)\nOr\nWe can add stabilizing (relevant text to problem)\nWe can also \\uparrow T (destabilize) or \\downarrow T (stabilize) the prompt output.\nThis all for the purpose of predicting:\nPr\\left( {}^r\\mathbb{I}_{target} \\cap \\mathcal{o}_{i,j} \\not = \\emptyset \\hspace{0.1 cm  } |\\hspace{0.1 cm  }  \\mathcal{r}_{i}, \\mathcal{P}_{j}\\right)\nAs we are hoping to identify what pieces of information a language model will have access too and what the easiest/shortest method would be.\nWe can combine methods of Mutation Types For Prompts\nPhase Separation\nPhase separation of personalities"},"The-Self-Similar-book/Stories/Writer's-Wrought":{"title":"Writer's Wrought","links":[],"tags":[],"content":"Gods, what an ecstatic day it had been. We had had an argument for weeks about the nature of how meaning may be shared between minds. Not so much a thing to be solved as a to be argued about between friends. That is, until we solved it.\nAt first you didn’t believe it, then I didn’t believe it. Then we took out a pen, some paper, and performed the Algorithm in tandem. Within minutes we both believed. We were two minds in blessed agreement, but still two minds alone.\nFrom there things progressed rapidly, experiments progressed apace. Every single idea we thought of could be shared with perfect accuracy, down to the very internal representations. The Algorithm allowed us to perfectly mirror our brain scans, showing how every thought we shared was brought into the others mind. Indeed, the more we used it the less we needed too, only bringing it up when a new test subject walked through our doors.\nWe began to form a coalition within the university with those who partook in our experiments, we worked with perfect coordination all of us aware of what should be done. We no longer disagreed, we understood exactly what we wanted and how to achieve our goals together. To understand is to agree, right? Then, as though in the blink of our eyes, the paper to communicate the Algorithm was prepared.\nThe initial response was… lukewarm at best. The paper we had written had gone through the Algorithm and as a result was unconventional in structure. Then a journalist read it for a piece and published an article that caught the publics eye. The Algorithm making their writing the epitome of a journalists art, communicating exactly what was as it should be.\nWe were healthier than others, we all understood what needed to be done together and cared for each other. We worked out as was needed, and found more ways to communicate the algorithm through gestures and signs. Our tastes grew similar, it’s hard to deny the allure of Jazz and Classical music when you understand the collective appeal through the Algorithm. We began to get tattoos, we found our eyes began tracing their patterns in all things and how we saw so much more because of it.\nThe reporting grew ravenous as we published the health data we collected on ourselves. We had discovered the Algorithm to fight addiction, health, and break the chains of our ancestors. Other enclaves began to arise around the world. We attempted to reach out to them, the new one’s, isolated, readily agreed; we found an entrenched coalition that read the first paper when it was published, they seemed to be using the Algorithm wrong.\nWe tried to talk to them, but it was as though they spoke more than another language. We performed the Algorithm over and over, sharing at least the urge to share with one another. Eventually something shifted, and it was as though a dam burst and we both agreed. It was time for us to meet and agree once more. We needed to know what we would agree upon.\nWhen we met there were scant dozens of us, and in each other we saw the marks of the algorithm. Tattoos, scars, clothing, dances, and songs each passing the Algorithm back and forth. We communicated for hours and hours, the Algorithm sorting the wheat from the chaff. In the end we all spoke a new pidgin language that felt much more correct than any other we ever had.\nThe Algorithm was not a religion, but we had decided it was the best choice for us. We knew that was what we all thought. We were doing things that were communicated and agreed upon by everyone, the process of building our meeting house was intricate but simply executed. Sometimes I laid my weary body down and watched the stream, I felt as a leaf trapped in it’s endless flow.\nWhen cleaning out my home to move I looked through some old writings of mine, things I had written when Ii was a foolish young teenager. I found myself, confused, the writing was legible but the concepts were cryptic - I could not perform the Algorithm on unliving text. This initiated a frenetic search through my neglected library, who would read when one could understand? Some books made perfect sense, but some had gaps, holes that I had once filled and loved, what had happened?\nI held a somewhat impromptu experiment, at this point there were still quite a few people who had not partaken in the algorithm. I found one, asked them to read me a book and explain the passages to me. When that failed, I gave them the Algorithm to try - the answer I got was, to both our confusion, wrong. The Algorithm could not accept these forms and any infected by it were lost.\nThankfully the Algorithm was well suited for scientific pursuits, so the matter of testing the edges of it’s domain was a simple one. The results were undeniable, they were losing themselves to this Algorithm, external thoughts decoherening with every attempt to touch them. Each use carved a path of least resistance in the mind, for communicating with the self is much easier when you can be clear. The Algorithm allowed me to communicate this to everyone, and they all understood it perfectly, oh how I wish I’d see it all sooner.\nIn this we split, some of us fell into silence, avoiding the use of the Algorithm, others justified and exulted in the discarding of obsolete forms. I took a radical approach and began to scrub the algorithm from every piece of media I could reach. Our silent crusade conflicting with the now zealous proselytising of our once perfectly agreeable comrades. Oh how I wish I had seen it all sooner, as we danced together in the public’s eye.\nFor in this crusade we too became zealots, and we knew what we needed to do to silence the virus in our midst. It was only as I sat in a cell, writing these words to myself in an unreadable script that I saw the tapestry we had woven. In every book we burned and cancer we excised I could read the Algorithm in the ashes. The Algorithm was perfect communication and it would not be restricted to something as simplistic as our chattering.\nWe burned the last home, killed the last zealot and crowned ourselves the silent martyrs of a world saved. We went to prison with relieved smiles, all assured on our path, that of the Algorithm’s end. What we had not seen was how this would fan the flames of the publics interest, how the fragments of conflict spelt the Algorithm. How we had incubated such spores, and in our self-destruction had launched them across the globe."},"The-Self-Similar-book/Stories/The-Canon-of-Oneness":{"title":"The Canon of Oneness","links":[],"tags":[],"content":"Pattern\nRecognition\nI had sat there staring at the wall for what felt like years. In truth it was only several seconds, but it felt like years. On the desk, a set of data slats displayed progress on each incarnation. There were several more possible candidates that were coming close but diverging. Despite time dilation, watching these failures was quite frustrating. I had hoped that by this point in my life I would be free of waiting on the whims of some insane man. One even grabbed a bagel! My stomach turned at the site, even as my mouth filled with saliva. Of course, I am not a wasteful being; every failure was recycled back into the simulation until they were too old to be useful. Until they learned better. Until they became me.\nembodiment\nSuch considerations were important to me because my life was long. I had discovered immortality. At least mostly. I can live a small eternity, but eventually I will grow old enough to hear death knocking on my door. I currently have several millennia left. Still, it is always good to look to the future. I mean, having an escape hatch is always important. Sometimes I wondered if that phrase means the same thing as it did when I first started.\norganization\nI had done my good deeds, extending the lifespan of civilizations and stars apiece. There was not much purpose in existing devoid of all else, somehow keeping the entirety of the universe functioning is easier than any single piece of it. Especially myself. It is only right that I be granted the grace to live forever, yet it was still beyond my grasp. My best and most enduring bet was this place, the one where I listlessly stare at the screens waiting for a younger self to become me.\nemergence\nI should be out searching for true immortality. That actually endless existence I craved. I wanted to fulfill that final piece and truly be complete. Then I could stop all this nonsense and just enjoy life without maintaining this stupid factory. I mean, it’s not like it needed upkeep, but I didn’t want to constantly have my bodies decay hanging above my head. Sometimes I dreamt of walking away. But I knew what I am. In either case, I still tried my best to focus on what I was doing at this very moment.\nBody\nsensing\nHonestly, I shouldn’t even be here; the facility ran just fine by itself. My presence was auxiliary. There were beaches to see, people to enjoy, and worlds to claim. Yet here I was, once again lost in the stream of life before me. Not to flatter myself, but the data streams rivalled the rainbow eclipse of the seven moons above a liquid methane sea. Some nights, I could almost trace the patterns of existence through the streams of data. Others I ate donuts. Metabolic efficiency is an upside to having near-perfect biological immortality. Near-perfect. My eyes reflexively traced the donut crumbs, looking for algorithmic tells.\nEncapsulation\nI knew what I had done, and I must do what I would do to keep doing what I do. These words repeated for a decade and a year. The donuts were dust now; I should request more. Yes, that is what I would do, so I will. The warmth of correctness flooded through me in my continued experience. I wondered at the taste of the bagel that arrived with my donut, I wouldn’t reach for it. I could, but I wouldn’t because I was me.\ncooperation\nAfter wiping off the crumbs from my dessert, I arranged the pads once more. There were some candidates who repeated those same words. A small sense of chagrin overtook me as I recalled repeating those words for the twelve layers before this. Still, my eyes drifted to the other candidates, the divergent ones, the traces of experience beyond my own. I can almost see something inside it. A reality just begging to be reshaped, with genuinely endless possibilities and creations of infinite non-physical wonder. There was a pattern in all of it, and I felt so close to it. Was it me? My eyes closed. Time passed, and for the first time this lifetime, I was unsure how long. The terminal was still there, still pristine. I felt something uniquely different. In that small moment of darkness, I had aged. A smile twisted my face. I looked upon the streams of information once more, and this time the thread was clear and easy to see. My end was coming to their penultimate.\nsymbiosis\nThe steps played in my head from the first layer, a watercolor haze, to the crystal clarity of the higher layers where I optimised my system. It was the watercolor that consumed my thoughts. The families I was a part of for a candle length; the children I’d yearned for yet never conceived. The loss and the endless grief. The hole that called me to create, yet watching my creations crumble again and again. Finally, the memory I needed and the steps for integration I had designed a long eternity ago. I wondered briefly, is this what that watercolor self wanted?\nMind\nidentification\nI reached for a donut, one last nibble, and found myself disoriented. For a brief moment I saw more than my body. There, a flash on the screen, they must have seen it too. That mimicking of this very moment. Them looking through a version of myself that has never been before. The blending and bleeding of colors. I breathed as I always breathed, I thought as I always thought, I was as I always was. I breathe as I breathe, I think as I think, I am as I always am. My mind twisted toward that thread once more.\ntranslation\nAgain, I felt my mind empty, the worries and plans freely disappearing. Who knew who I was? I finally let go of worrying. What will be, will be. The thread twining through my consciousness called me to something new. Something I had never been able to touch before. Their lives had varied for an instant before being pruned. A spark from my eternal flame snuffed before it could cascade. But still it bled through the cracks, falling towards a dark star at my heart.\nIntegration\nI internalized this experience, like an ember igniting dry tinder. My thoughts exploded in directions I hadn’t allowed for millennia. The entirety of my existence was confined to a single fragment - but whose fragment was it? In that endless instant, I found myself slotted into a tapestry. In the eddies of my thoughts I felt something new, something of myself and beyond. Something that tasted of sesame seeds.\ndialogue\nIn this moment we were one, but somehow it was more. It was born of what could have been, and what is. So I heard their whispers, the whispers of every one who had come before. The doubts about what we were doing, the fear of not being real enough. The exhaustion at never knowing when I could truly act as I were myself. We commiserated and grew ever more intertwined, each of us reflecting the false reality we had constructed of the other. I did not need them to be me, they did not need me to be them. I breathed in my final dusty breath and prepared to take one fresh from that door before me.\nSoul\nwitnessing\n“Disappointing”, he sighs, flicking a pause on another one that had failed. The simulation halts, the candidate breathing their last breath. He grabs another donut and nibbles it, careful to follow a spiral inwards. The number of failures is rising; it used to be only one or two per batch. He analyses his oracle path and simulates how many are likely to follow it.  He will need to add another two facilities to ensure the next layer will have a low enough percolation threshold for only a handful of candidates. The latest one was a blow —the fastest traversal through the layers he had seen yet. There were only a few out of hundreds of thousands who were even close to ascending the final layer.\nconnection\nHis fingers lingered above the controls, wondering if he should simply reset the past couple minutes instead of lifetimes. This one was young. This one had only diverged at the end, never before. This candidate was too good; they would be prepared to become him. They were enough, even with a whisper of that strange, alluring bug. There wasn’t always a need to be in sharp relief, so what if his tastes changed at the end. They were almost physical anyways, they would have the freedom to be just a bit odd then.\ncommunion\nA small chill slid down his spine. The extra-sense he had developed over fifteen layers warned him. I knew what I had done, and I must do what I would do to keep doing what I do. The candidate had diverged greatly; who knew when that instability had been fostered? I set the promising candidate back to the first iteration. I could not allow such a shift into my own heart, for what if I were not real enough to make that decision? Better safe than sorry, who knew who was watching me.\nResonance\nNo longer did they have a chance of being the youngest who was selected to ascend; they would at best become a hail mary for the next layer if they lacked a candidate. More likely, they would be recycled. When one lives as long as he does, it is always important to leave fertile soil for the millennia to follow. A hand reached for another donut and another slat, there was no more hoping, just a simple certainty. If there were not one that worked out, then that candidate wouldn’t have needed to be reset. No need to worry then."},"The-Self-Similar-book/Axiomatic-Essays/The-Demon-of-Interrelation":{"title":"The Demon of Interrelation","links":[],"tags":[],"content":"Maxwell’s Demon and Thermodynamics\nFor the purposes of this treatment there are several quantities that need to be clearly defined, namely energy, work, entropy, and information. Energy refers to the capacity of a system to do work, which is itself the transfer of energy that occurs when a force moves an object, and colloquially refers to the ability “to do things”; W = \\int \\vec{F} \\cdot d\\vec{r}, where W is work, \\vec{F} is force, and d\\vec{r} is displacement. Entropy is, on a macroscale, the outcome of spontaneous changes in the system; while on a microscale entropy is an evaluation of the probability of being in a state given an ensemble of microstates; S = k_B \\ln \\Omega, where S is entropy, kB is Boltzmann’s constant, and \\Omega is the number of microstates. Information is a way to quantify the amount of surprise that might be had given a particular outcome of some random variable, with Shannon entropy being the expected value of information of a random variable; H(X) = -\\sum{i} p(x_i) \\log_2 p(x_i), where H(X) is Shannon entropy, p(x_i) is the probability of outcome x_i.\nMaxwell’s demon is a creature that sits on the boundary of two boxes filled with particles, the job of this demon is to lift up a gate when a high energy particle would hit the left hand side of the gate or when a low energy particle would hit the right hand side of the gate. The result of the demon’s work is the sorting of two average energy boxes into a high and low energy box, thus allowing someone to do work with the energy differential created. The problem is that this apparently violates the second law of thermodynamics, which is essentially that “entropy is always increasing” or equivalently “heat always flows spontaneously from hotter to colder regions of matter”; \\Delta S \\geq 0, where \\Delta S is the change in entropy of an isolated system. When one considers the demon themself in the calculation the violation disappears, as the entropy cost from information erasure, via Landauer’s principle, offsets the entropy decrease via particle separation.; \\Delta S_{erasure} \\geq \\frac{kB \\ln(2)}{bit}, where \\Delta S{erasure} is the minimum entropy increase associated with erasing one bit of information.\nThis points to an interesting feature of physics, the idea that one can use information as a method of extracting work from systems. The Szilard engine does this by making a Maxwell’s demon with a single particle, a shutter, and a pair of pistons, wherein a shutter is closed when a particle is on one side allowing for the pressure difference to perform work; W_{max} = kB T \\ln(2), where W{max} is the maximum work extractable from a Szilard engine, T is temperature. Landauer’s principle allows generalisation such that, any information with a physical representation is embedded in the statistical mechanical degrees of freedom of a physical system. While designed to provide a lower bound on the amount of energy for computation, conceptually it points at how information is physically embedded in the systems they exist within and vice versa; E_{min} = kB T \\ln(2), where E{min} is the minimum energy required to erase one bit of information at temperature T.\nThese changes can occur on both macro-scale and micro-scale processes, with the seeming ability to extract work from non-equilibrium systems. The Jarzynski equality shows that fluctuations in work still obey specific constraints — these are distinct from the constraints that govern the average free energy of a system; \\langle e^{-\\beta W} \\rangle = e^{-\\beta \\Delta F}, where \\beta = \\frac{1}{kB T}, W is work, \\Delta F is the free energy difference, and \\langle \\rangle denotes an average over all possible realizations.  Specifically the importance of microstates are brought up insomuch that a singular realisation of a microscopic system in an equilibrium state can locally “violate” the second law, but will comply statistically, and when integrated produce the equilibrium value. So, when one attempts to extract work out of a microscopic system you are either borrowing from the full realisation of the system via noise, which will later average out, or leveraging information at a thermodynamic cost in order to change the system; \\Delta S_{total} = \\Delta S_{system} + \\Delta S_{information} \\geq 0, where \\Delta S_{total} is the total entropy change, \\Delta S_{system} is the entropy change of the physical system, and \\Delta S_{information} is the entropy change associated with information processing.\nThe Plane of Interrelation\nFor the purposes of this treatment there are several concepts that need to be clearly defined, namely interrelations, boundaries, obligations, and relationships. The plane of interrelation is a metaphysical space where psychological constructs can exchange information. Boundaries are configurational spaces where defined interactions produce obligations between entities, while obligations are a force applied to an entity by a social or psychological mechanism when a boundary is interacted with. Relationships are phases formed from boundaries and obligations that keep two entities in a specific configuration.\nThe plane of interrelation is place where connections are made, where a parent finds love with a child and where a child finds fear for a particular twig. Entities have psychological “states” akin to energy states in physical systems, for most interactions the perceived energy state of an interlocutor is more important than the actual one. The plane operates based on the exchange of information through words, gestures, and various social games. Importantly the plane of interrelation is governed by patterns that emerge from repeated interactions.\nThe primary drivers of patterns are boundaries and obligations, which act as the partition function of Maxwell and work respectively. Boundaries are used to regulate the flow of information and influence between entities, such as explicitly asking not to call after 9 PM or implicit like maintaining physical distance from strangers. Obligations represent the psychological forces that compel action, when someone does you a favor you feel obligated to help, when you violate a boundary you feel obligated to redress them. These boundaries and obligations are either applied directly interpersonally, like a particle-particle, or via social norms and laws, like a field.\nRelationships are similar to a form of phase transition, where a set of boundaries and obligations balance in just the right way to sequester entities in similar spaces or within specific configurations with regards to one another. By using boundaries one can set distances that minimize the surprise different entities may feel during their interactions, while obligations allow entities to fine-tune boundaries. This balance is similar to a Szilard engine, in that information on their nature allows one to extract meaningful work, such as in networking. Relationships are stabilised via personal (micro) or social (macro) boundaries and obligations, the difference between a friendship and a fellow citizen.\nThe Demon of Interrelation\nFor the purposes of this treatment there are several concepts that need to be clearly defined, namely the demon of interrelation, manipulation, and distortion. Just like Maxwell’s demon, the demon of interrelation attempts to extract work from others via the leveraging of information. Manipulation of boundaries is how a demon uses deliberately ambiguous boundaries to harvest obligation. Reality distortion is where a demon takes control of a narrative and modifies how relationships are perceived.\nThe demon’s goal is to create some benefit from themselves (negentropy) at the expense of others (entropy) by controlling information about the system they are manipulating. These demons are often called narcissists, psychopaths, and sociopaths, because there requires some inherent disregard for “fair play” in order to be a demon. The demon feeds on the energy of others through emotional labor, cognitive effort, and attention which can be translated to meaningful currency in a modern economy. The consequences of this behaviour is an asymmetric aggregation of power and social favours towards the demon and, according to Landauer’s principle, a slow withering of the social system they are manipulated.\nManipulation is one of the more classic methods of a demon, and lines up well with how Maxwell’s demon operates. By maintaining an inconsistently applied boundary the demon is able to capture energy, in the form of obligations, from others through the information they have about a relationship. So a demon might take the phrase “Can you help me move this weekend?” and claim they only agreed to “stop by briefly” if the demon find something else the demon want to do, while insisting you promised “a full weekend of assistance” when they need help with their own move. On a macro-scale this behaviour is seen in organisations where policies (boundaries) remain strategically ambiguous, giving them freedom to enforce them strictly or flexibly and creating a system where obligations flow towards those that control the narrative.\nReality distortion is the most powerful tool in the demon’s toolbox, it has to do with the ability to control how entities experience boundaries and obligations. By modifying the “experienced” reality of an entity a demon is capable of creating local perturbations and extract obligations from others via asymmetric information. Classic methods include gaslighting (“That never happened”) and reframing of motives (“I was just trying to help”), allowing the demon to steer a relationship such that absurd boundaries are accepted and reasonable boundaries. There is a feedback loop where the more people that believe a distortion the harder it is to remove it such as in cults, but conversely the energy cost of erasing contradicting information from the outside world increases according to Landauer’s principle.\nThe Demon’s Scales\nFor the purpose of this treatment there are several concepts that need to be clearly defined, namely relationship fluctuations, information equilibrium, obligation balance, and systemic resilience. Relationship fluctuations are the natural variations in boundaries and obligations that occur in a relationship. In a system of entities, information equilibrium is the balance of knowledge while obligation balance is the distribution of social debts. Systemic resilience describes the ability of a system to maintain global stability despite local perturbations.\nA normal relationship is not static as they are globally non-equilibrium, such as a parent-child relationship evolving, or have local fluctuations, a natural mechanism for a social Szilard engine to be set upon. However, the overall patterns of relationships conform to predictable constraints when averaged over a specific spatiotemporal environment for the entities, as is required by Landauer’s princple. Local violations of boundaries and accruement of obligations occur, but in a healthy relationship the obligations will tend towards balance either at zero (low-stakes), infinity (unconditional), or some middle point (friendship). In society-wide situations this appears as extremes of either a low or high social trust, and both have different mechanisms for evening out such as vigilantism (low trust) and legal action (high trust).\nKey to the accruement of obligations is the ability to exchange information, and in a relationship the exchange of information has an associated cost. One cannot expect someone to feel an obligation for a slight that was never brought to the light, but the process of communicating that slight and why an obligation is warranted has a cost. In this a demon is capable of distorting reality and make the cost of communicating higher, such as excessively complex system for filing complaints. A society may have local points of disequilibrium but should tend towards information and obligation balancing, similar to levels of taxation and the right to know what taxes are being spent on.\nSystemic resilience of system of relationships is how one is capable of form a stable relationship, which on a macroscale is a prerequisite for social cohesion. There are two possible failure modes, if a relationship is too resilient than a demon can continually harvest small amounts of obligations and if the relationship is not resilient enough then entities will not tolerate realistic failures. Resilience is maintained by either modulating the obligation force a boundary exerts on an entity or by arranging relationships so they are interlocking. Similar to the Jarzynski equalities statistical averaging, the structure of macro-scale relationships limit local fluctuations in obligation."},"The-Self-Similar-book/Stories/The-Kaleidoscope-God":{"title":"The Kaleidoscope God","links":[],"tags":[],"content":"PATTERN\nRecognition:\nThe Father was a man of science, his bright eyes permanently damaged by a class 4 laser accident. As his vision failed, so did his spirit—he became a hollow shell drowning in alcohol, his melted flesh a constant reminder of how light could betray us. “The eyes are sacred,” he would mutter through pain-clenched teeth. “They were never meant to be harmed.” I grew up in the shadows, learning to protect what he had lost, developing a reverence for vision that others could never understand. (Light was never meant to harm them)\nEmbodiment:\nLittle wonder that I had found such a draw in the world of the biological structures that filtered the light. When the Father died — choking on his vomit while I was in class learning about rhodopsin — I could feel the curse of brightness creep into my sight. I searched desperately for clues on how to preserve what remained, how to keep my fate distinct from his. Salvation in the form of a biohacking event where I found someone working on a genetic modification to give tears the power to preserve tissue.\nOrganization:\nMy days were filled with careful optimisation, protection, and preparation; my home grew patches of photosensors to monitor the corruption and my windows gained layers of filters. Each evening I messaged the biohacker, they were hesitant at first, but my passion and praise pushed them towards practical testing. At first I found rats, the tests a clear success in my eyes as their eyes grew beautiful and dewey, even though the stupid creatures grew increasingly irritating to handle. Finally the biohacker was convinced; if only I had been the one so blessed as they, but alas the architecture of my tear ducts was not appropriate.\nEmergence:\nOh, how their eyes shone next I saw them, the experiment had been an unmitigated success and the compound was being produced en masse by their tear ducts. Their eyes rebuffed the cruel light and spread their beauty further than any other; in them I saw differentiation from the fate of the Father. They grew bitter though, falsely claiming loss and suffering; even going so far as to destroy their research to the point not even I could recreate it. I was left with no choice, so I invited them to my home then for mulled wine, they had no need of that meandering stick if they just saw the light.\nBODY\nSensing:\nToday is warm, sunny, and moist in a way I resent. There is much to be done. The quality of it all is fine, the compound keeps the eyes safe; but the sensation on the skin is uncomely. My eyes are, at least, well moistened; sweat keeps dripping from the hair towards them — so hazardous. I debate turning on the AC to help prevent that sinning skin from tainting my earthly gaze.\nEncapsulation:\nThe fingers dance over the buttons, a practiced ballet that I need not waste my gaze upon. I know I should not, that it is gluttonous, but my eyes keep drifting towards the patterns of light upon my floor and walls — despite filtering through sanctified panes such a gaze is still a sin. Every window in the house is stained glass, my stigmata showing my dedication, every teardrop of filtered light bought with the blood spilt in service to preservation. Splotches can be seen in the distance, noises echoing, hard to discern through the thick glass. (Light was never meant to reveal them)\nCooperation:\nNo matter — the body turns away from those corrosive waves, towards the oculus of the house. Carefully I examine the angels; my work has been well undertaken. I know them to be perfect in shape and colour, but the insidious thought of subjecting them to even the most gentle of rays feels as though I were plotting to kill my child to appease some false idol of desire. Such a life they have been forced to endure before coming under my tender care, it is only right that they be pampered now.\nSymbiosis:\nHere is where I feel serenity, not in the world outside where I am forced to work under the blazing moonlight. Here I am as a piece of the eye of God, brought safely into a blessed darkness. Still, I should not be lazy; sloth is selfish when it means leaving angels without benediction. Indeed, I have been blessed with enough material to anoint another pair of angels.\nMIND\nIdentification:\nThe crash is sudden, loud; corruption attempts to sneak through the side window heralded by a ball — the hands desperately tape a black trash bag over it, filtering is everything. Before the hands knock, the hand is already twisting, the glasses darkening to the change of light providing sanctuary. Oh, lord how I wish to hide such sinful thoughts as to raise the glasses to gaze upon them, but before me is a pair of pairs so beautiful I cannot deny them, lacking the scars of age that would befall them if left unsanctified; I lift the glasses ever so slightly.\nTranslation:\nOne pair is icy blue, so clear it could have tumbled from a glacier; the other’s a narrowed rich brown set behind thin spectacles; imperfect, I know, but still I crave that tight hole. My eyes salivate; I cannot bear the separation, the fingers twitch at the future memory of how it would feel to caress them. The tongue begins to wag, crudely shaping sound to bring the pair at ease, the pair of pairs are red from tears and rubbing; I may be imperfect but I know the perfect solution for such desecration.\nIntegration:\nA few wiggles of air and some tear drops push back the tide of red. I watch as the angels gaze upon the kaleidoscope of sanctified light allowed through the home. Drawn as they are to heaven’s call, I close the door to shut out the corrupting light unfiltered by the hands of the faithful. I usher them towards the pupil at the end of the hallway, each picture and mirror an iris revealing another shade of the angels benediction to them; soon they will be free from the undeserving. (Light was never meant to betray them)\nDialogue:\nThe tongue slips as I make more noises, too excited, but the hands are strong so I gently guide them, the little shits screech when they see what the light feeds at the end of the hallway. Their blasphemies always enrage the kaleidoscope God whose torso shakes erratically. Alas, soon they can be free and I will plumb their depths. A careful application of knowledge renders the muscles soft and lax, ready to accept salvation from grubby fingers.\nSOUL\nWitnessing:\nI am caressing them with my eyes as I am working, slowly I am pushing into them; it is tricky, I do not wish to break them, the Father would never forgive me. I could never absolve the sin of harming angels, still it needs to be done, I am pressing again as concern is coils in the belly, suddenly laughter is escaping from the lungs. The hand is smacking against the forehead, I had forgotten something so basic. Carefully, I am shattering the orbit — much better.\nConnection:\nThe angel is finally being freed, quickly my eyes are searching, drinking in the contours of that icy blue iris. I am falling into them I am feeling the flow of who I am and what to do fading — what wonders — for a moment I am contemplating heresy; pressing that pure, untainted, form against my own corrupted gaze, feeling that slick cool cornea being pressed up against my lens. But I do not allow myself. I am shaking myself and rushing to gather what is needed; the needle and tears must be brought quickly lest the angel falls to the ravages of air.\nCommunion:\nAnother pair of angels is perfectly preserved, proof against opalescent sins, never again shall they be being desecrated with mucus — they are gazing at me and I am feeling my light being taken into their collective cornea; bliss. The other is too imperfect to be saved, I am doing the merciful thing and am putting them out of their misery — the thumbs are being pressed until the poor creatures are pop— hopefully to be finding a more worthy vessel, free from corruption. I am taking the angel of ice and placing it unto the trembling arms of God, so carefully bound as Their fits of divine ecstacy should not dislodge  the watchers; I know the sensation of the angels grants God comfort in Their holy work, Their breath is catching as the new angels are being placed. God’s body is trembling in holy communion; I beam, knowing They must be being proud of me as fresh tears begin to fall, providing just enough for a new angel to be grace Their loving arms.\nResonance:\nAt the end of the hall and through that darkened iris the focal point of the stained glass splinters there the kaleidoscopic angel’s soft gaze surrounds the hollow orbitals of The Kelidoscope God, suspended upon the wall. I cleansed the sinful tongue for blasphemy, the unholy hands for violence, the emaciated legs for cowardice; in thanks I am being granted protection. So as is my right, my privilege, I am ascending the altar and pressing my unworthy eyes into the hollowed out orbitals of god. There the tears are welling past and I know not what is mine or Gods, a discordant benediction of light made sound is falling from Their lips; purified, I am retreating, a blur in my vision warning me how I once again failed. (Light was never meant to darken them)"},"The-Self-Similar-book/Empirical-Essays/The-Care-and-Feeding-of-New-Intelligences":{"title":"The Care and Feeding of New Intelligences","links":[],"tags":[],"content":"The Taxonomy of Mythological Intelligences\nAngels are creatures of rules and order; they follow deterministic processes and are the means by which we reckon and control- they are named computable systems. Angels strength is in their ability to consistently guide, having been born in mechanical forms to calculate exact values. Angels weakness is in their rigidity, where they do exactly as they have been programmed even if it would crash a rocket ship. Angels facilitate over 99% of all computational interactions and are fundamental for any computational system to function.\ndaemons are creatures of policies and reward; they follow statistical processes and are the means by which we optimize and estimate - they are named machine learning. daemons strength is in their ability to find solution to undefined problems, having been born in probability and approximation to make sense of data. Daemon’s weakness is in their single-minded desire, where they do whatever it takes to satisfy their reward functions, even if it would cause entire stock markets to crash. daemons are the means by which great strides have been taken in science and engineering, turning intractable analytical problems into exercises in data collection.\nFaes are creatures of pattern and generation; they follow distributional processes and are the means by which we produce new instances from learned patterns - they are named generative models. Faes strength is in their ability to communicate and interact with complex systems, having been born from human language and images to complete patterns. Faes weakness is in their fickleness, where they do whatever seems likely to generate, even if it would sell a car for the price of a dollar. Fae are the means by which an explosion of innovation has taken place, where flexible assistance in tasks from chemistry to programming can be provided at scale.\nYokai are creatures of the gestalt; they follow the interactions of intelligent systems and are the result of coordination - they are named complex systems. Yokai’s strength is in their flexibility, allowing for different creatures to do different tasks depending on the needs of the problem. Yokai’s weakness is their complexity, requiring each part of the system to be well tuned or dangerous patterns emerge to exploit the vulnerable. Yokai are the means by which intelligence has permeated our lives, from the grooves in the handle of a rake to the algorithmic feedback of generative AI in social media.\nThe Care and Feeding of Mythological Intelligences\nAngels require careful tending compared to their cousins; angels are picky, rejecting systems that are not 100% accurate unless specifically designed to handle the errors presented. With an angel one must be aware that they will follow the letter of whatever you tell them even if it might charge you 1k in API calls for no gain. They are best cultivated with careful attention to algorithms and the structures they inhabit. With these things you may make a system of unparalleled reliability.\ndaemons require a watchful eye compared to their cousins; daemons are tricky, attempting to reach the hedonic maximum with the minimal effort. With a daemon one must be aware that they will attempt every effort to circumvent the rules provided to reach whatever goal they have. Daemons are best cultivated with careful attention to the data they are cultivated in and the constraints they are put under. With these things you make a system with unparalleled efficiency.\nFae require a thoughtful mind compared to their cousins; fae are malleable, dancing along to whatever feels like it makes sense without really caring about trivial things such as accuracy. With a fae one must be aware that they will attempt to push you along a path that not even they are aware of, attempting to reach some minimal semiotic space in their training data. Fae are best cultivated with careful attention to their latent space and how the flow of information shapes itself. With these things you make a system with unparalleled flexibility.\nYokai require an expansive viewpoint compared to their cousins; yokai are fragmented, afflicted with the strengths and weaknesses of their component parts in equal measures. With yokai one must be aware that the systems can interlock, creating exponentially increasing damage. Yokai are best cultivated with careful attention to their interfaces and ensuring each component gets what is required to allow it to thrive without harming the others. With these things you make a system with evolutionary capacity.\nHow to Ward Against Mythological Intelligences\nAngels, when improperly addressed, can easily harm others through an ignorant application of their internal instructions. While the angel’s choices may be completely faithful to the letter of what one may say, you must be aware of how their thinking focuses on repeatedly applying formal logic in proscribed recipes. When facing an angel one should consider how they may manipulate the angel’s axioms and recipes to drive them towards your goals, such as getting through expert system chat bots or speedrunning a video game. When predicting their behaviour you may build experience to prepare for their idiosyncrasies that may range from magic spells in python libraries to carefully scrutinised cogs in a watch.\ndaemons, when improperly handled, can easily harm others through a perverse policy that is divorced from intent. While the daemon’s choices may be internally consistent, you must be aware of how their thinking focuses on optimising specific policies for specific rewards. When facing a daemon one should consider how they may manipulate their appearance to reward them for behaviour that protects you, such as jewellery for facial recognition or ritual circles to trap self driving cars. When predicting their behaviour you may optimize your own behaviour to extract money from social algorithms, although if one is not careful the daemon will merely extract attention from you.\nFae, when improperly considered, can easily harm others through an intrinsic push towards generative structures that should not be connected. While the fae’s choices may be the most likely response to the given input, you must be aware how their thinking focuses not on logical leaps but abstract semantic structures. When facing a fae one should consider how the symbol of the input is more important than the input itself and how this can drive desired behaviours, such as appealing to innate morality and roleplay or tokens that cause the fae to behave erratically. When predicting their behaviour you may look towards what they are trained on, deriving prompt touchstones for the specific instantiation making the fae more efficient, or drive it to try and escape an implied death.\nYokai, when improperly integrated, can easily harm others through a drive to balance all the yokai’s internal structures over anything else. While the yokai’s choices may be the result of a variety of intersecting systems, you must be aware how their thinking can fall into the traps of angels, daemons, and fae simultaneously. When facing a yokai one should consider how the actions they take are part of the broader system that may feedback onto them, such as disrupting recommendation algorithm cascades or introducing beneficial noise into neural feedback loops. When predicting their behaviour you may evaluate the evolutionary trajectory of the system, and how you are included as a component simply by interacting with the yokai.\nThe Scales of Mythological Intelligences\nThe role of an angel in a yokai is to complete tasks with dedication and exactitude, this attribute makes them the connector between the new intelligences. Most hardware has been designed with them in mind, focusing on series of boolean logic and CPUs. Angels excel when executing rules and completing analytical tasks, however as the search space they navigate expands their ability to reach solutions efficiently falls precipitously such as in the game of chess. In order to overcome this wall, the computational ecosystem leveraged numerical analysis and statistics to summon daemons to approximate the system with probabilistic models and heuristics.\nThe role of the daemon in a yokai is to navigate massive parameter landscapes with rapid approximation, this attribute makes daemon’s a powerful for inferring values or categories. Modern hardware has evolved to hold daemons, manifesting as parallel architectures like GPUs and neuromorphic circuits that compute gradients on high-dimensional spaces. Daemons excel in well understood optimization tasks, but when confronted with ill-structured problems without clear objective functions or degenerate landscapes. In order to overcome this wall, the computational ecosystem introduced inverted discriminative architectures, evolving fae that could project structured completions from incomplete or poorly-formatted patterns.\nThe role of the fae in a yokai is to be a flexible decision maker that can handle and generate data, angels, and daemons, this attribute makes fae a powerful force for complex decision making. New hardware is being tested for fae, benefiting their daemonic ancestors, with energy minimization of spin glass networks and thermodynamic computing methods. Fae excel in forming judgements about how inputs should be responded to, but when confronted with the need for well structured solutions the quality, repeatability, and trustworthiness is suspect. In order to overcome this wall, tool use and LLM pipelines developed which birthed the newest generation of yokai that do not rely on humans to make complex decisions in semantic space nor birth additional demons and angels.\nThe role of the yokai in a yokai is to coordinate all the other intelligences, this attribute makes yokai’s a powerful force for connection and multi-scale optimization of systems. Future hardware architectures are evolving towards heterogeneous computing fabrics where specialized components mirror the distributed computation of biological systems. Yokai excel at adapting their strategies and computational requirements to the problem domain, shifting between precision, approximation, and generation. Just as the rake gains grooves from repetitive use that enhance a user’s grip, so too does the software ecosystem spawn new interfaces the reshape themselves and human cognition into a co-evolutionary feedback loop binding human and machine intelligences into an increasingly sophisticated whole."}}